# Необходимо написать программу, которая будет считывать 
# со стандартного ввода название города и время и выводить
# информацию в формате 
# “Current location is [Location] and time is [Time]”.
location = input()
time = input()
print("Current location is " + location + " and time is " + time)
